window.pageContent = {
  "heroDescription": "IronMan 是一款基于 Rhino 8 软件平台的结构设计辅助插件。它是作者从事建筑结构设计工作十多年的经验结晶。基于这款插件，作者编制了许多结合业务落地的Grasshopper脚本文件，详情请见应用案例部分。",
  "sponsorText": "山水有相逢，静待知音人。\r\n个人赞助 ≥200 元，可添加作者私人微信获取技术指导。\r\n企业赞助，将永久列入“赞助伙伴”鸣谢墙。",
  "caseStudies": [
    {
      "title": "ALC横条板排布",
      "description": "“ALC横条板排布”GH脚本是一位初学者的作品。但是这份作品完整地呈现了对一个建筑立面图进行ALC横条板排布的效果。GH脚本不仅呈现了排布后的效果，还能提供多种排布逻辑供设计师选用。它的执行目标是用最少的异形板块数量、最高的板块利用率来填满整个建筑立面。建筑师再也不用手动一块一块地去进行立面排版了。"
    },
    {
      "title": "超限梁柱支撑截面调整",
      "description": "“超限梁柱支撑截面调整”GH脚本可以实现对钢框架、PEC框架结构的梁、柱、支撑构件进行优化调整。GH脚本通过从YJK计算结果中读取结果数据，以图形形式展现在rhino窗口中。用户可以自定义优化参数，通过IronMan插件驱动GH脚本进行多轮构件截面优化迭代。赋予设计师设计自由度的同时，极大地提高设计师调模型工作效率。优化流程执行过程中需结合Euler插件进行数据读写。"
    }
  ]
};
